Revit 2026 API

# SpaceCalculatedCoolingLoad Property

---

Get the Calculated Cooling Load of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double CalculatedCoolingLoad { get; }
```
```vb
Public ReadOnly Property CalculatedCoolingLoad As Double
	Get
```
```cpp
public:
property double CalculatedCoolingLoad {
	double get ();
}
```
```fsharp
member CalculatedCoolingLoad : float with get
```

#### Property Value

Double

This property is used to get the Calculated Cooling Load of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace